{"keras_version": "2.1.5", "backend": "tensorflow", "config": [{"config": {"dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_1", "trainable": true, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "filters": 32, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_2", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "filters": 32, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_3", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "filters": 64, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_4", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "filters": 64, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_5", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "filters": 64, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_6", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "filters": 64, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_1", "trainable": true, "units": 512, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_2", "trainable": true, "units": 10, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}